"""
### Списки:

1. **Робота із списками:**
   Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і виведіть отриманий список.

2. **Знаходження суми:**
   Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.

3. **Подвійні значення:**
   Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.

### Кортежі:

1. **Робота із кортежами:**
   Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин"). Виведіть кожен елемент кортежу окремо.

2. **Об'єднання кортежів:**
   Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.

### Словники:

1. **Робота із словниками:**
   Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.

2. **Оновлення словника:**
   Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання). Додайте до словника нову улюблену книгу та виведіть оновлений словник.

3. **Пошук значення:**
   Завдання: Створіть словник, що містить інформацію про країни та їх столиці. Запитайте користувача про назву країни і виведіть столицю цієї країни (якщо така країна є у словнику).

Завершіть кожне завдання, використовуючи вбудовані методи для списків, кортежів та словників. Бажаю успіхів у виконанні цих завдань!
"""


# Списки:
# 1
list_1 = [x for x in range(7)]
list_1 += 10, 20
list_1.remove(10)
print(list_1)

# 2
list_2 = [x for x in range(13)]
print(sum(list_2))

# 3
list_3 = [x for x in range(7, -1, -1)]
doubled_list_3 = [x * 2 for x in list_3]
print(doubled_list_3)


# Кортежі:
# 1
tuple_1 = ("яблуко", "банан", "апельсин")
[print(fruit) for fruit in tuple_1]

# 2
tuple_2 = (1, 2, 5)
tuple_3 = (0, 7, 12)
tuple_4 = tuple_2 + tuple_3
print(tuple_4)


# Словники
# 1
dict_1 = {'name': 'John Doe',
          'age': 29,
          'discipline': 'racing',
          'team': 'eagles'}
[print(key, value) for key, value in dict_1.items()]

# 2
dict_2 = {1: ('Harry Potter', 2018), 2: ('Ready player one', 2019)}
dict_2[3] = 'Dark side of the moon', 2007
print(*list(dict_2.values()), sep='\n')

# 3
dict_3 = {'Ukraine': 'Kyiv',
          'Poland': 'Warsaw',
          'France': 'Paris'}
user_input = input('Введіть назву країни англійською: ')
print(dict_3.get(user_input, 'No such country in DB'))
